#
# 第１章、第９章で使ったデータ
#

# 表1.1 を用意する

.tbl1.1 <- matrix(c(301, 497, 208, 50, 254, 187,
                261, 550, 250, 27, 339, 157,
                361, 534, 204, 59, 324, 216, 
                463, 766, 334, 72, 350, 601,
                89, 350, 195, 12, 143, 167,
                23, 182, 124, 10, 60, 110,
                117, 298, 145, 11, 184,56,
                104, 379, 219,21, 152,213,
                130, 352, 153, 17, 272, 264,
                168,370, 187, 51, 162, 424),byrow= T,10,6 )

dimnames(.tbl1.1) <- list(
  余暇 = c("スポーツイベント","映画","ダンス/ディスコ",
         "カフェ/レストラン","劇場","クラッシック・コンサート",
         "ポップ・コンサート","絵画展","図書館","教会サービス"),
  職種 = c("現業","Low非現業","High非現業","農民","学生","退職者"))

.tbl1.1

#
# 対応分析を行う
#

library(FactoMineR)# CA を行う
res.CA <- CA(.tbl1.1,graph=FALSE)
plot(res.CA,title="表1.1を対応分析")

summary(res.CA)


#
# 基本統計量を図示する
#
source("CATools.R")

draw_screeplot(res.CA)# スクリープロ
disp_contr(res.CA)# 絶対的寄与
disp_corr2(res.CA)# 平方相関
qty_cos2(res.CA) # 質


